app/views/equipment/_form.html.erb

    <%= f.input :serial_number %>
    <%= f.association :status, collection: Status.all.order(:current), label_method: :current, value_method: :id ,prompt: "Choose a Status" %>
    <%= f.association :category, collection: Category.all.order(:id), value_method: :id ,prompt: "Choose a Status" %>
---
SELECT "statuses".* FROM "statuses" ORDER BY "statuses"."current" ASC
SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC