app/controllers/equipment_controller.rb

SELECT "equipment".* FROM "equipment"
---
  def index
    respond_to do |format|
      format.html {@equipment = Equipment.all}